<a href="https://colab.research.google.com/github/arz03/ads-lab/blob/main/dataframe.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np

# Creating DF

create df from dict of list
list of dict
list of list
np array

In [ ]:
dict1 = {'name': ['Arjun', 'Vyomesh', 'Anuj'],
         'city': ["Mumbai", "Delhi", "Chennai"]
        }

In [ ]:
dict_df = pd.DataFrame(dict1)
dict_df

      name     city
0    Arjun   Mumbai
1  Vyomesh    Delhi
2     Anuj  Chennai

lis=[['Arj','abc'],
     [1,2]]
lis_df=pd.DataFrame(lis)
lis_df

In [ ]:
l1 = ['Arjun', "Ashvin","Anuj"]
l2 = ['Bhopal', 'Indore', 'Reva']
list_df = pd.DataFrame(l2,l1)
list_df

             0
Arjun   Bhopal
Ashvin  Indore
Anuj      Reva

In [ ]:
nparr = np.array([1,2,3])
np_df=pd.DataFrame(nparr)
np_df

   0
0  1
1  2
2  3

In [ ]:
lis_of_dict = [{'a':'one','b':1},{'a':'two','b':2}]
ltd_df=pd.DataFrame(lis_of_dict)
print(ltd_df)
print('transpose:\n',ltd_df.T)

     a  b
0  one  1
1  two  2
transpose:
      0    1
a  one  two
b    1    2

# Attributes of df

In [ ]:
df_data= {'name': ['Arjun', 'Vyomesh', 'Anuj'],
         'city': ["Mumbai", "Delhi", "Chennai"]
        }
df_attr=pd.DataFrame(df_data)

In [ ]:
df_attr.index

RangeIndex(start=0, stop=3, step=1)

In [ ]:
df_attr.columns

Index(['name', 'city'], dtype='object')

In [ ]:
df_attr.values

array([['Arjun', 'Mumbai'],
       ['Vyomesh', 'Delhi'],
       ['Anuj', 'Chennai']], dtype=object)

In [ ]:
df_attr.shape

(3, 2)

In [ ]:
df_attr.size

6

In [ ]:
df_attr.ndim

2

In [ ]:
df_attr.dtypes

name    object
city    object
dtype: object

In [ ]:
df_attr.empty

False

In [ ]:
df_attr.axes

[RangeIndex(start=0, stop=3, step=1), Index(['name', 'city'], dtype='object')]

In [ ]:
df_attr.T

           0        1        2
name   Arjun  Vyomesh     Anuj
city  Mumbai    Delhi  Chennai

# Descriptive Statistics

In [ ]:
sta = pd.DataFrame({'animal': ['alligator', 'bee', 'falcon', 'lion','monkey', 'parrot', 'shark', 'whale', 'zebra']})
sta2_data = {'Product': ['Mobile', 'AC', 'Mobile', 'Sofa', 'Laptop'],
        'Price': [20000, 28000, 22000, 19000, 45000],
        'Year': [2014, 2015, 2016, 2017, 2018]
        }
sta2 = pd.DataFrame(sta2_data, columns = ['Product', 'Price', 'Year'])
sta
sta2

  Product  Price  Year
0  Mobile  20000  2014
1      AC  28000  2015
2  Mobile  22000  2016
3    Sofa  19000  2017
4  Laptop  45000  2018

In [ ]:
sta.head()

      animal
0  alligator
1        bee
2     falcon
3       lion
4     monkey

In [ ]:
sta.tail()

   animal
4  monkey
5  parrot
6   shark
7   whale
8   zebra

In [ ]:
sta2.info(verbose=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Product  5 non-null      object
 1   Price    5 non-null      int64
 2   Year     5 non-null      int64
dtypes: int64(2), object(1)
memory usage: 248.0+ bytes

In [ ]:
sta.describe()

           animal
count           9
unique          9
top     alligator
freq            1

In [ ]:
sta2['Price'].mean()

26800.0

In [ ]:
sta2['Price'].median()

22000.0

In [ ]:
sta2.mode()

  Product  Price  Year
0  Mobile  19000  2014
1     NaN  20000  2015
2     NaN  22000  2016
3     NaN  28000  2017
4     NaN  45000  2018

In [ ]:
sta2['Price'].min()

19000

In [ ]:
sta2['Price'].max()

45000

In [ ]:
sta2.count()

Product    5
Price      5
Year       5
dtype: int64

In [ ]:
sta2.value_counts()

Product  Price  Year
AC       28000  2015    1
Laptop   45000  2018    1
Mobile   20000  2014    1
         22000  2016    1
Sofa     19000  2017    1
Name: count, dtype: int64

In [ ]:
sta2['Product'].value_counts()

Product
Mobile    2
AC        1
Sofa      1
Laptop    1
Name: count, dtype: int64

# Selection and Indexing

In [ ]:
data = {
    'Name': ['Arjun', 'Anuj', 'Vyomesh', 'Ashvin'],
    'Age': [25, 30, 35, 40],
    'City': ['Bhopal', 'Jabalpur', 'Bhopal', 'Reva'],
    'Fee' : [84000, 89000, 15000, 12345]
}
df=pd.DataFrame(data, index=['a', 'b', 'c', 'd'])

In [ ]:
df.loc['a']

Name     Arjun
Age         25
City    Bhopal
Fee      84000
Name: a, dtype: object

In [ ]:
df.loc['b':'c']

      Name  Age      City    Fee
b     Anuj   30  Jabalpur  89000
c  Vyomesh   35    Bhopal  15000

In [ ]:
df.iloc[1]

Name        Anuj
Age           30
City    Jabalpur
Fee        89000
Name: b, dtype: object

In [ ]:
df.iloc[2:]

      Name  Age    City    Fee
c  Vyomesh   35  Bhopal  15000
d   Ashvin   40    Reva  12345

In [ ]:
df.at['b', 'Name']

'Anuj'

In [ ]:
df.iat[1,0]

'Anuj'

# Rows and Column operations

In [ ]:
data = {
    'Product': ['Laptop', 'Phone', 'Tablet', 'Monitor'],
    'Price': [1200, 800, 300, 200],
    'Stock': [30, 50, 100, 25]
}
df = pd.DataFrame(data)
df2=df.copy()

In [ ]:
df2.drop('Price', axis=1, inplace=True)

In [ ]:
df

   Product  Price  Stock
0   Laptop   1200     30
1    Phone    800     50
2   Tablet    300    100
3  Monitor    200     25

In [ ]:
df2

   Product  Stock
0   Laptop     30
1    Phone     50
2   Tablet    100
3  Monitor     25